app/controllers/actors_controller.rb

  def index
    @actors = Actor.all
---
SELECT `actors`.* FROM `actors`

  def show
    @actor = Actor.find params[:id]
---
SELECT  `actors`.* FROM `actors` WHERE `actors`.`id` = 1 LIMIT 1

  def create
    actor = Actor.create(actor_params)
---
INSERT INTO `actors` (`name`, `description`, `created_at`, `updated_at`) VALUES ('hello', 'goodbye', '2020-07-09 13:31:33', '2020-07-09 13:31:33')

  def destroy
    @actor = Actor.find(params[:id])
    print @actor
    @actor.destroy
---
SELECT  `actors`.* FROM `actors` WHERE `actors`.`id` = 1 LIMIT 1
DELETE FROM `actors` WHERE `actors`.`id` = 1

  def edit
    @actor = Actor.find(params[:id])
---
SELECT  `actors`.* FROM `actors` WHERE `actors`.`id` = 2 LIMIT 1

  def update
    @actor = Actor.find(params[:id])
    @actor.update(actor_params)
---
SELECT  `actors`.* FROM `actors` WHERE `actors`.`id` = 2 LIMIT 1
UPDATE `actors` SET `name` = 'hello you ', `description` = 'goodbye you', `updated_at` = '2020-07-09 13:35:14' WHERE `actors`.`id` = 3