app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT `questions`.* FROM `questions`

  def create
    question = Question.create(question_params)
---
INSERT INTO `questions` (`text`, `created_at`, `updated_at`) VALUES ('fqsf', '2020-07-15 11:49:00', '2020-07-15 11:49:00')